[{"Title":"StarTalk Radio","Summary":"Science meets comedy and pop culture on StarTalk Radio! Astrophysicist and Hayden Planetarium director Neil deGrasse Tyson, his comic co-hosts, guest celebrities and scientists discuss astronomy, physics, and everything else about life in the universe. \n\nListen to StarTalk Radio podcasts on our website, www.startalkradio.net, and just about everywhere across the cosmos: iTunes, SoundCloud, Stitcher, Tune-In and more. You’ll also find us on YouTube, Facebook, Twitter, Google+, Tumblr, Instagram, Pinterest and other social media channels. Keep Looking Up!\n\n\n\n","URL":"http://feeds.soundcloud.com/users/soundcloud:users:38128127/sounds.rss","Path":"T:\\Music\\Podcasts\\StarTalk"},{"Title":"Nintendo Voice Chat","Summary":"IGN editors discuss all things Nintendo. Now you're playing with power!","URL":"http://feeds.ign.com/ignfeeds/podcasts/wii?format=xml","Path":"T:\\Music\\Podcasts\\Nintendo Voice Chat"},{"Title":"WEDway Radio - Walt Disney World and Disneyland Examined with some Disney History","Summary":"Hosts Matt and Nate discuss the history of Disney theme parks and the Walt Disney Co.  In examining we look at influences that shaped the company including projects and eras.  We look at attractions and themed lands including the architectural styles and inspiration behind many of the decisions that the walt Disney Co has made over the years.","URL":"http://feeds2.feedburner.com/Wedwayradio5","Path":"T:\\Music\\Podcasts\\WEDWAY Radio"},{"Title":"Planetary Radio: Space Exploration, Astronomy and Science","Summary":"Space exploration, astronomy and planetary science. (Weekly)","URL":"http://www.planetary.org/multimedia/podcasts/planetary-radio-podcast-rss.xml","Path":"T:\\Music\\Podcasts\\PlanetaryRadio"},{"Title":"Communicore Weekly","Summary":"Official Website for Communicore Weekly!","URL":"http://www.communicoreweekly.com/feed/","Path":"T:\\Music\\Podcasts\\CommunicoreWeekly"},{"Title":"NWR's Radio Trivia: Podcast Edition","Summary":"Nintendo World Report (the site behind sister podcast Radio Free Nintendo) celebrates video game music in this trivia podcast! Listeners are challenged to identify video games from classic and modern Nintendo systems based on a sampling of their soundtracks!","URL":"http://www.nintendoworldreport.com/rss/radiotriviamp3","Path":"T:\\Music\\Podcasts\\RadioTrivia"},{"Title":"Today I Found Out","Summary":"Learn Interesting Facts Every Day","URL":"http://feeds.feedburner.com/TodayIFoundOut","Path":"T:\\Music\\Podcasts\\DailyKnowledgePodcast"},{"Title":"Serial","Summary":"Serial is a new podcast from the creators of This American Life, hosted by Sarah Koenig. Serial unfolds one story - a true story - over the course of a whole season. The show follows the plot and characters wherever they lead, through many surprising twists and turns. Sarah won't know what happens at the end of the story until she gets there, not long before you get there with her. Each week she'll bring you the latest chapter, so it's important to listen in, starting with Episode 1. New episodes are released on Thursday mornings. Serial, like This American Life, is a production of WBEZ Chicago.","URL":"http://feeds.serialpodcast.org/serialpodcast","Path":"T:\\Music\\Podcasts\\Serial"},{"Title":"99% Invisible","Summary":"A Tiny Radio Show about Design with Roman Mars","URL":"http://feeds.99percentinvisible.org/99percentinvisible","Path":"T:\\Music\\Podcasts\\99Invisible"},{"Title":"BackStory","Summary":"BackStory with the American History Guys is a nationally syndicated, hour-long, weekly public radio show. We're based in Charlottesville, Virginia at the Virginia Foundation for the Humanities.\n\nEach week we take a topic that people are talking about and explore its roots in American history. Through stories, interviews, and conversation with our listeners, we turn the things Americans take for granted inside out. And while we're at it, we have a lot of fun. Join us.","URL":"http://feeds.feedburner.com/BackStoryRadio","Path":"T:\\Music\\Podcasts\\BackStoryRadio"},{"Title":"Inquiring Minds","Summary":"Each week Inquiring Minds brings you a new, in-depth exploration of the place where science, politics, and society collide.\r\n\r\nWe’re committed to the idea that making an effort to understand the world around you though science and critical thinking can benefit everyone—and lead to better decisions.  We endeavor to find out what’s true, what’s left to discover, and why it all matters with weekly coverage of the latest headlines and probing discussions with leading scientists and thinkers.\r\n\r\nProduced in partnership with Climate Desk, a journalistic collaboration dedicated to exploring the impact of a changing climate and consisting of The Atlantic, Center for Investigative Reporting, Grist, The Guardian, Mother Jones, Slate, and Wired.","URL":"http://feeds.feedburner.com/inquiring-minds","Path":"T:\\Music\\Podcasts\\InquiringMinds"},{"Title":"Revolutions","Summary":"A weekly podcasting exploring great political revolutions. ","URL":"http://revolutionspodcast.libsyn.com/rss","Path":"T:\\Music\\Podcasts\\Revolutions"},{"Title":"the memory palace","Summary":"the memory palace","URL":"http://feeds.feedburner.com/thememorypalace","Path":"T:\\Music\\Podcasts\\TheMemoryPalace"},{"Title":"Mousetalgia! - An Unofficial Disneyland Podcast","Summary":"Carpe Kingdom - A podcast discussing Disneyland and anything Disney!","URL":"http://mousetalgia.libsyn.com/rss","Path":"T:\\Music\\Podcasts\\Mousetalgia"},{"Title":"Damn Interesting","Summary":"The audio side of DamnInteresting.com: Legitimately intriguing true stories from history, science, and psychology.","URL":"http://feeds.feedburner.com/damn-interesting-podcast","Path":"T:\\Music\\Podcasts\\DamnInteresting"}]